FKDD_COPY_DIFF_3_2026-02-13/Reports/УРВ_АнализЭффективностиРаботыЦеха.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>УРВ_АнализЭффективностиРаботыЦеха</Name>
			<Comment>Анализ эффективности работы цеха</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Comment>Вид отчета: обороты, остатки, остатки и обороты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыводаОтчета</Name>
					<Comment>Режим отображения: табличный документ, сводная таблица, диаграмма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыводаОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыНастроек</Name>
					<Comment>Текущее имя формы настроек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаОформленияТабличногоДокумента</Name>
					<Comment>Имя макета оформления табличного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрыОтчета</Name>
					<Comment>Фильтры отчета</Comment>
					<Type>
						<v8:Type>d7p1:Filter</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеПоляОтбора</Name>
					<Comment>Доступные поля отбора</Comment>
					<Type>
						<v8:Type>cfg:CustomFields</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтчета</Name>
					<Comment>Номер товарного отчета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
					<Comment>Сохраненные настройки отчета</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦехСотрудник</Name>
					<Comment>Цех сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Comment>Объект формирования отчета</Comment>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыИзмеренийСтрок</Name>
					<Comment>Параметры измерений строк</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЦехам</Name>
					<Comment>По цехам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Функции</Name>
					<Comment>Функции отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования функции</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
					<Comment>Показатели отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования показателя</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматнаяСтрока</Name>
							<Comment>Форматная строка отображения показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Положение</Name>
							<Comment>Положение показателя в табличном документе</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ПоложенияПоказателяТабличногоДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияСтроки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияКолонки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/AccumulationRegisters/ВыработкаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВыработкаСотрудников</Name>
			<Comment>Выработка сотрудников по работам</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество выполненных работ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНормочасов</Name>
					<Comment>Количество нормочасов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНормочасовФакт</Name>
					<Comment>Количество нормочасов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма выполненных работ в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпрСоСкидкой</Name>
					<Comment>Сумма выполненных работ в валюте управленческого учета со скидкой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник, выполняющий работы по заказ-наряду</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Comment>Авторабота, выполненная сотрудником</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРемонта</Name>
					<Comment>Вид ремонта заказ-наряда</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Comment>Цех выполнения работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Ремонтируемый автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Reports/УРВ_АнализЭффективностиРаботыЦеха/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Модуль отчета
	
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем МакетОтчета, ОформлениеСтроки; // оформления
Перем ТаблицаПриход,ТаблицаРасход; // таблицы
Перем СоответствиеХозОперацийПереоценки; // Соответствие хоз операций переоценки
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

//Заполняет начальные настройки
//
//Без параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета = "ТекстЗапроса", ИмяМакетаПараметров="Параметры") Экспорт
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

//Формирует текст запроса
//
// Параметры
//   Реж - строка - режим запроса (Движения, Остатки)
//
// Возвращаемое значение:
//   ТекстЗапроса – текст
//
Функция ПолучитьТекстЗапроса()
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВыработкаСотрудников.Сотрудник,
		|	ВЫБОР
		|		КОГДА ВыработкаСотрудников.Цех.ЦехДляАнализаЭффиктивности <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|			ВыработкаСотрудников.Цех.ЦехДляАнализаЭффиктивности
		|		ИНАЧЕ
		|			ВыработкаСотрудников.Цех
		|	КОНЕЦ КАК Цех
		|ПОМЕСТИТЬ ТаблЦехаСотрудники
		|ИЗ
		|	РегистрНакопления.ВыработкаСотрудников КАК ВыработкаСотрудников
		|ГДЕ
		|	ВыработкаСотрудников.Период МЕЖДУ &ДатаНач И &ДатаКон
		|{
		|ГДЕ
		|	ВыработкаСотрудников.Сотрудник.*
		|}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УРВ_ТабельноеВремя.Сотрудник,
		|	УРВ_ТабельноеВремя.Цех
		|ИЗ
		|	РегистрСведений.УРВ_ТабельноеВремя КАК УРВ_ТабельноеВремя
		|ГДЕ
		|	УРВ_ТабельноеВремя.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И УРВ_ТабельноеВремя.ВидИнтервала.РабочийИнтервал = ИСТИНА
		|{
		|ГДЕ
		|	УРВ_ТабельноеВремя.Сотрудник.*
		|}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегистрацияВремениРабот.Сотрудник,
		|	ВЫБОР
		|		КОГДА РегистрацияВремениРабот.РабочееМесто.ЦехДляАнализаЭффиктивности <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|			РегистрацияВремениРабот.РабочееМесто.ЦехДляАнализаЭффиктивности
		|		ИНАЧЕ
		|			РегистрацияВремениРабот.РабочееМесто
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.РегистрацияВремениРабот КАК РегистрацияВремениРабот
		|ГДЕ
		|	РегистрацияВремениРабот.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И РегистрацияВремениРабот.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка)
		|{
		|ГДЕ
		|	РегистрацияВремениРабот.Сотрудник.*
		|}
		|
		|;
		|ВЫБРАТЬ
		|ТаблЦехаСотрудники.Сотрудник,
		|ТаблЦехаСотрудники.Цех
		|ПОМЕСТИТЬ ТаблЦехаСотрудникиГрупп
		|ИЗ
		|ТаблЦехаСотрудники КАК ТаблЦехаСотрудники
		|
		|СГРУППИРОВАТЬ ПО
		|ТаблЦехаСотрудники.Сотрудник,
		|ТаблЦехаСотрудники.Цех
		|;
		|ВЫБРАТЬ
		|	ТаблЦехаСотрудники.Цех КАК Цех,
		|	ТаблЦехаСотрудники.Сотрудник КАК Сотрудник,
		|	СУММА(ЕСТЬNULL(ТаблВыработка.ВремяПлан, 0)) КАК ВремяПлан,
		|	СУММА(ЕСТЬNULL(ТаблТабельВремя.ВремяТабель, 0)) КАК ВремяТабель,
		|	СУММА(ЕСТЬNULL(ТаблФактВремя.ВремяФакт, 0)) КАК ВремяФакт
		|ИЗ
		|	ТаблЦехаСотрудникиГрупп КАК ТаблЦехаСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВыработкаСотрудников.Сотрудник КАК Сотрудник,
		|			ВЫБОР
		|				КОГДА ВыработкаСотрудников.Цех.ЦехДляАнализаЭффиктивности <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|					ВыработкаСотрудников.Цех.ЦехДляАнализаЭффиктивности
		|				ИНАЧЕ
		|					ВыработкаСотрудников.Цех
		|			КОНЕЦ КАК Цех,
		|			СУММА(ВыработкаСотрудников.КоличествоНормочасов) КАК ВремяПлан
		|		ИЗ
		|			РегистрНакопления.ВыработкаСотрудников КАК ВыработкаСотрудников
		|		ГДЕ
		|			ВыработкаСотрудников.Период МЕЖДУ &ДатаНач И &ДатаКон
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВЫБОР
		|				КОГДА ВыработкаСотрудников.Цех.ЦехДляАнализаЭффиктивности <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|					ВыработкаСотрудников.Цех.ЦехДляАнализаЭффиктивности
		|				ИНАЧЕ
		|					ВыработкаСотрудников.Цех
		|			КОНЕЦ,
		|			ВыработкаСотрудников.Сотрудник) КАК ТаблВыработка
		|		ПО ТаблЦехаСотрудники.Цех = ТаблВыработка.Цех
		|			И ТаблЦехаСотрудники.Сотрудник = ТаблВыработка.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РегистрацияВремениРабот.Сотрудник КАК Сотрудник,
		|			ВЫБОР
		|				КОГДА РегистрацияВремениРабот.РабочееМесто.ЦехДляАнализаЭффиктивности <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|					РегистрацияВремениРабот.РабочееМесто.ЦехДляАнализаЭффиктивности
		|				ИНАЧЕ
		|					РегистрацияВремениРабот.РабочееМесто
		|			КОНЕЦ КАК Цех,
		|			СУММА(РегистрацияВремениРабот.Продолжительность) КАК ВремяФакт
		|		ИЗ
		|			РегистрСведений.РегистрацияВремениРабот КАК РегистрацияВремениРабот
		|		ГДЕ
		|			РегистрацияВремениРабот.Период МЕЖДУ &ДатаНач И &ДатаКон
		|			И (РегистрацияВремениРабот.ВидОтметки = ЗНАЧЕНИЕ(Справочник.ВидыОтметокВремени.Работа)
		|			ИЛИ РегистрацияВремениРабот.ВидОтметки = ЗНАЧЕНИЕ(Справочник.ВидыОтметокВремени.РаботаПоУдаленномуПакету))
		|		
		|		СГРУППИРОВАТЬ ПО
		|			РегистрацияВремениРабот.Сотрудник,
		|			ВЫБОР
		|				КОГДА РегистрацияВремениРабот.РабочееМесто.ЦехДляАнализаЭффиктивности <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|					РегистрацияВремениРабот.РабочееМесто.ЦехДляАнализаЭффиктивности
		|				ИНАЧЕ
		|					РегистрацияВремениРабот.РабочееМесто
		|			КОНЕЦ) КАК ТаблФактВремя
		|		ПО ТаблЦехаСотрудники.Сотрудник = ТаблФактВремя.Сотрудник
		|			И ТаблЦехаСотрудники.Цех = ТаблФактВремя.Цех
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УРВ_ТабельноеВремя.Цех КАК Цех,
		|			УРВ_ТабельноеВремя.Сотрудник КАК Сотрудник,
		|			СУММА(УРВ_ТабельноеВремя.Часы) КАК ВремяТабель
		|		ИЗ
		|			РегистрСведений.УРВ_ТабельноеВремя КАК УРВ_ТабельноеВремя
		|		ГДЕ
		|			УРВ_ТабельноеВремя.Период МЕЖДУ &ДатаНач И &ДатаКон
		|			И УРВ_ТабельноеВремя.ВидИнтервала.РабочийИнтервал = ИСТИНА
		|		
		|		СГРУППИРОВАТЬ ПО
		|			УРВ_ТабельноеВремя.Цех,
		|			УРВ_ТабельноеВремя.Сотрудник) КАК ТаблТабельВремя
		|		ПО ТаблЦехаСотрудники.Цех = ТаблТабельВремя.Цех
		|			И ТаблЦехаСотрудники.Сотрудник = ТаблТабельВремя.Сотрудник
		|
		|{
		|ГДЕ
		|	ТаблЦехаСотрудники.Сотрудник.* КАК Сотрудник,
		|	ТаблЦехаСотрудники.Цех.* КАК Цех
		|}
		|СГРУППИРОВАТЬ ПО
		|	ТаблЦехаСотрудники.Цех,
		|	ТаблЦехаСотрудники.Сотрудник
		|ИТОГИ
		|	СУММА(ВремяПлан),
		|	СУММА(ВремяТабель),
		|	СУММА(ВремяФакт)
		|ПО
		|	ОБЩИЕ,
		|	Цех,
		|	Сотрудник";
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапроса()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокРезультат – ТабличныйДокумент или ПолеТабличногоДокумента
//
// Возвращаемое значение:
//  Результат - ТабличныйДокумент
//
Функция СформироватьТабличныйДокумент (ДокРезультат=Неопределено) Экспорт
	Если ТипЗнч(ДокРезультат) <> Тип("ПолеТабличногоДокумента") И ТипЗнч(ДокРезультат) <> Тип("ТабличныйДокумент") Тогда
		ДокРезультат = Новый ТабличныйДокумент();
	Иначе ДокРезультат.Очистить();
	КонецЕсли;
		
	// проверим корректность заполнения
	Если ДатаНачала > ДатаКонца И ДатаКонца <> '00010101000000' Тогда
		Предупреждение("Дата начала периода не может быть больше даты конца периода", 60);
		Возврат ДокРезультат;
	КонецЕсли;
	
		
	// получим макеты для результата и оформления
	Макет = ПолучитьМакет("Основной");
		
	
	// СОЗДАДИМ ЗАПРОС
	Запрос = Новый Запрос;
	
	Настройки = ПостроительОтчета.ПолучитьНастройки(Истина,Ложь,Ложь,Ложь,Ложь);
	ПостроительОтчета.Текст = ПолучитьТекстЗапроса();
	ПостроительОтчета.УстановитьНастройки(Настройки,Истина,Ложь,Ложь,Ложь,Ложь);
	ПостроительОтчета.Параметры.Вставить("ДатаНач", НачалоДня(ДатаНачала));
	ПостроительОтчета.Параметры.Вставить("ДатаКон", КонецДня(ДатаКонца));
	ПостроительОтчета.Выполнить();
	ВыборкаИтоги = ПостроительОтчета.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ДокРезультат.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ДокРезультат.Вывести(ОбластьМакета);
	
	ДокРезультат.ОтображатьГруппировки = Истина;
	ДокРезультат.НачатьАвтогруппировкуСтрок();
	
	Пока ВыборкаИтоги.Следующий() Цикл
		СтрокаИтогов = ВыборкаИтоги;
		ВыборкаЦеха = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЦеха.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЦех");
			ОбластьМакета.Параметры.Заполнить(ВыборкаЦеха);
			ОбластьМакета.Параметры.Продуктивность = ?(ВыборкаЦеха.ВремяТабель<>0 И ВыборкаЦеха.ВремяТабель<>NULL, ВыборкаЦеха.ВремяПлан/ВыборкаЦеха.ВремяТабель,0);
			ОбластьМакета.Параметры.Эффективность = ?(ВыборкаЦеха.ВремяФакт<>0 И ВыборкаЦеха.ВремяФакт<>NULL, ВыборкаЦеха.ВремяПлан/ВыборкаЦеха.ВремяФакт,0);
			ОбластьМакета.Параметры.КоэффициентИспользования = ?(ВыборкаЦеха.ВремяТабель<>0 И ВыборкаЦеха.ВремяТабель<>NULL, ВыборкаЦеха.ВремяФакт/ВыборкаЦеха.ВремяТабель,0);
			ДокРезультат.Вывести(ОбластьМакета, 1);
			
			ВыборкаСотрудник = ВыборкаЦеха.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСотрудник.Следующий() Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСотрудник");
				ОбластьМакета.Параметры.Заполнить(ВыборкаСотрудник);
				ОбластьМакета.Параметры.Ресурс = ВыборкаСотрудник.Сотрудник;
				ОбластьМакета.Параметры.Продуктивность = ?(ВыборкаСотрудник.ВремяТабель<>0 И ВыборкаСотрудник.ВремяТабель<>NULL, ВыборкаСотрудник.ВремяПлан/ВыборкаСотрудник.ВремяТабель,0);
				ОбластьМакета.Параметры.Эффективность = ?(ВыборкаСотрудник.ВремяФакт<>0 И ВыборкаСотрудник.ВремяФакт<>NULL, ВыборкаСотрудник.ВремяПлан/ВыборкаСотрудник.ВремяФакт,0);
				ОбластьМакета.Параметры.КоэффициентИспользования = ?(ВыборкаСотрудник.ВремяТабель<>0 И ВыборкаСотрудник.ВремяТабель<>NULL, ВыборкаСотрудник.ВремяФакт/ВыборкаСотрудник.ВремяТабель,0);
				ДокРезультат.Вывести(ОбластьМакета, 2);
			КонецЦикла;
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтоги");
		ОбластьМакета.Параметры.Заполнить(СтрокаИтогов);
		ОбластьМакета.Параметры.Продуктивность = ?(СтрокаИтогов.ВремяТабель<>0 И СтрокаИтогов.ВремяТабель<>NULL, СтрокаИтогов.ВремяПлан/СтрокаИтогов.ВремяТабель,0);
		ОбластьМакета.Параметры.Эффективность = ?(СтрокаИтогов.ВремяФакт<>0 И СтрокаИтогов.ВремяФакт<>NULL, СтрокаИтогов.ВремяПлан/СтрокаИтогов.ВремяФакт,0);
		ОбластьМакета.Параметры.КоэффициентИспользования = ?(СтрокаИтогов.ВремяТабель<>0 И СтрокаИтогов.ВремяТабель<>NULL, СтрокаИтогов.ВремяФакт/СтрокаИтогов.ВремяТабель,0);
		ДокРезультат.Вывести(ОбластьМакета,1);
	КонецЦикла;
	
	ДокРезультат.ЗакончитьАвтогруппировкуСтрок();
	ДокРезультат.ЗакончитьАвтогруппировкуКолонок();
	ДокРезультат.ПоказатьУровеньГруппировокСтрок(1);
	ДокРезультат.ТолькоПросмотр = Истина;
	ДокРезультат.ФиксацияСлева = 3;
	ДокРезультат.ФиксацияСверху = 3;

	
	Возврат ДокРезультат;
КонецФункции // СформироватьТабличныйДокумент()

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
	
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();



#КонецЕсли
